apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
/****************************************************************************
 * arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_FLASH_H
#define __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_FLASH_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* FLASH geometry ***********************************************************/

#if defined(CONFIG_STM32_STM32U3C5XX)
#  define STM32_FLASH_NPAGES              512
#  define STM32_FLASH_PAGESIZE            4096
#else
#  error "Unsupported STM32U3 FLASH geometry"
#endif

#define STM32_FLASH_SIZE \
  (STM32_FLASH_NPAGES * STM32_FLASH_PAGESIZE)

/* Register Offsets *********************************************************/

#define STM32_FLASH_ACR_OFFSET        0x0000
#define STM32_FLASH_KEYR_OFFSET       0x0008
#define STM32_FLASH_SKEYR_OFFSET      0x000c
#define STM32_FLASH_OPTKEYR_OFFSET    0x0010
#define STM32_FLASH_PDKEY1R_OFFSET    0x0018
#define STM32_FLASH_PDKEY2R_OFFSET    0x001c
#define STM32_FLASH_SR_OFFSET         0x0020
#define STM32_FLASH_SSR_OFFSET        0x0024
#define STM32_FLASH_CR_OFFSET         0x0028
#define STM32_FLASH_SCR_OFFSET        0x002c
#define STM32_FLASH_ECCCR_OFFSET      0x0030
#define STM32_FLASH_ECCDR_OFFSET      0x0034
#define STM32_FLASH_OPSR_OFFSET       0x0038
#define STM32_FLASH_OPTR_OFFSET       0x0040
#define STM32_FLASH_BOOT0R_OFFSET     0x0044
#define STM32_FLASH_BOOT1R_OFFSET     0x0048
#define STM32_FLASH_SBOOT0R_OFFSET    0x004c
#define STM32_FLASH_SECWM1R1_OFFSET   0x0050
#define STM32_FLASH_SECWM1R2_OFFSET   0x0054
#define STM32_FLASH_WRP1AR_OFFSET     0x0058
#define STM32_FLASH_WRP1BR_OFFSET     0x005c
#define STM32_FLASH_SECWM2R1_OFFSET   0x0060
#define STM32_FLASH_SECWM2R2_OFFSET   0x0064
#define STM32_FLASH_WRP2AR_OFFSET     0x0068
#define STM32_FLASH_WRP2BR_OFFSET     0x006c
#define STM32_FLASH_SECBB1R1_OFFSET   0x0080
#define STM32_FLASH_SECBB1R2_OFFSET   0x0084
#define STM32_FLASH_SECBB1R3_OFFSET   0x0088
#define STM32_FLASH_SECBB1R4_OFFSET   0x008c
#define STM32_FLASH_SECBB1R5_OFFSET   0x0090
#define STM32_FLASH_SECBB1R6_OFFSET   0x0094
#define STM32_FLASH_SECBB1R7_OFFSET   0x0098
#define STM32_FLASH_SECBB1R8_OFFSET   0x009c
#define STM32_FLASH_SECBB2R1_OFFSET   0x00a0
#define STM32_FLASH_SECBB2R2_OFFSET   0x00a4
#define STM32_FLASH_SECBB2R3_OFFSET   0x00a8
#define STM32_FLASH_SECBB2R4_OFFSET   0x00ac
#define STM32_FLASH_SECBB2R5_OFFSET   0x00b0
#define STM32_FLASH_SECBB2R6_OFFSET   0x00b4
#define STM32_FLASH_SECBB2R7_OFFSET   0x00b8
#define STM32_FLASH_SECBB2R8_OFFSET   0x00bc
#define STM32_FLASH_SECHDPCR_OFFSET   0x00c0
#define STM32_FLASH_PRIVCFGR_OFFSET   0x00c4
#define STM32_FLASH_SECHDPEXTR_OFFSET 0x00c8
#define STM32_FLASH_PRIVBB1R1_OFFSET  0x00d0
#define STM32_FLASH_PRIVBB1R2_OFFSET  0x00d4
#define STM32_FLASH_PRIVBB1R3_OFFSET  0x00d8
#define STM32_FLASH_PRIVBB1R4_OFFSET  0x00dc
#define STM32_FLASH_PRIVBB1R5_OFFSET  0x00e0
#define STM32_FLASH_PRIVBB1R6_OFFSET  0x00e4
#define STM32_FLASH_PRIVBB1R7_OFFSET  0x00e8
#define STM32_FLASH_PRIVBB1R8_OFFSET  0x00ec
#define STM32_FLASH_PRIVBB2R1_OFFSET  0x00f0
#define STM32_FLASH_PRIVBB2R2_OFFSET  0x00f4
#define STM32_FLASH_PRIVBB2R3_OFFSET  0x00f8
#define STM32_FLASH_PRIVBB2R4_OFFSET  0x00fc
#define STM32_FLASH_PRIVBB2R5_OFFSET  0x0100
#define STM32_FLASH_PRIVBB2R6_OFFSET  0x0104
#define STM32_FLASH_PRIVBB2R7_OFFSET  0x0108
#define STM32_FLASH_PRIVBB2R8_OFFSET  0x010c
#define STM32_FLASH_OEM1KEYR1_OFFSET  0x0110
#define STM32_FLASH_OEM1KEYR2_OFFSET  0x0114
#define STM32_FLASH_OEM1KEYR3_OFFSET  0x0118
#define STM32_FLASH_OEM1KEYR4_OFFSET  0x011c
#define STM32_FLASH_OEM2KEYR1_OFFSET  0x0120
#define STM32_FLASH_OEM2KEYR2_OFFSET  0x0124
#define STM32_FLASH_OEM2KEYR3_OFFSET  0x0128
#define STM32_FLASH_OEM2KEYR4_OFFSET  0x012c
#define STM32_FLASH_OEMKEYSR_OFFSET   0x0130

/* Register Addresses *******************************************************/

#define STM32_FLASH_ACR        (STM32_FLASHIF_BASE + STM32_FLASH_ACR_OFFSET)
#define STM32_FLASH_KEYR       (STM32_FLASHIF_BASE + STM32_FLASH_KEYR_OFFSET)
#define STM32_FLASH_SKEYR      (STM32_FLASHIF_BASE + STM32_FLASH_SKEYR_OFFSET)
#define STM32_FLASH_OPTKEYR    (STM32_FLASHIF_BASE + STM32_FLASH_OPTKEYR_OFFSET)
#define STM32_FLASH_PDKEY1R    (STM32_FLASHIF_BASE + STM32_FLASH_PDKEY1R_OFFSET)
#define STM32_FLASH_PDKEY2R    (STM32_FLASHIF_BASE + STM32_FLASH_PDKEY2R_OFFSET)
#define STM32_FLASH_SR         (STM32_FLASHIF_BASE + STM32_FLASH_SR_OFFSET)
#define STM32_FLASH_SSR        (STM32_FLASHIF_BASE + STM32_FLASH_SSR_OFFSET)
#define STM32_FLASH_CR         (STM32_FLASHIF_BASE + STM32_FLASH_CR_OFFSET)
#define STM32_FLASH_SCR        (STM32_FLASHIF_BASE + STM32_FLASH_SCR_OFFSET)
#define STM32_FLASH_ECCCR      (STM32_FLASHIF_BASE + STM32_FLASH_ECCCR_OFFSET)
#define STM32_FLASH_ECCDR      (STM32_FLASHIF_BASE + STM32_FLASH_ECCDR_OFFSET)
#define STM32_FLASH_OPSR       (STM32_FLASHIF_BASE + STM32_FLASH_OPSR_OFFSET)
#define STM32_FLASH_OPTR       (STM32_FLASHIF_BASE + STM32_FLASH_OPTR_OFFSET)
#define STM32_FLASH_BOOT0R     (STM32_FLASHIF_BASE + STM32_FLASH_BOOT0R_OFFSET)
#define STM32_FLASH_BOOT1R     (STM32_FLASHIF_BASE + STM32_FLASH_BOOT1R_OFFSET)
#define STM32_FLASH_SBOOT0R    (STM32_FLASHIF_BASE + STM32_FLASH_SBOOT0R_OFFSET)
#define STM32_FLASH_SECWM1R1   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM1R1_OFFSET)
#define STM32_FLASH_SECWM1R2   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM1R2_OFFSET)
#define STM32_FLASH_WRP1AR     (STM32_FLASHIF_BASE + STM32_FLASH_WRP1AR_OFFSET)
#define STM32_FLASH_WRP1BR     (STM32_FLASHIF_BASE + STM32_FLASH_WRP1BR_OFFSET)
#define STM32_FLASH_SECWM2R1   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM2R1_OFFSET)
#define STM32_FLASH_SECWM2R2   (STM32_FLASHIF_BASE + STM32_FLASH_SECWM2R2_OFFSET)
#define STM32_FLASH_WRP2AR     (STM32_FLASHIF_BASE + STM32_FLASH_WRP2AR_OFFSET)
#define STM32_FLASH_WRP2BR     (STM32_FLASHIF_BASE + STM32_FLASH_WRP2BR_OFFSET)
#define STM32_FLASH_SECBB1R1   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R1_OFFSET)
#define STM32_FLASH_SECBB1R2   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R2_OFFSET)
#define STM32_FLASH_SECBB1R3   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R3_OFFSET)
#define STM32_FLASH_SECBB1R4   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R4_OFFSET)
#define STM32_FLASH_SECBB1R5   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R5_OFFSET)
#define STM32_FLASH_SECBB1R6   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R6_OFFSET)
#define STM32_FLASH_SECBB1R7   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R7_OFFSET)
#define STM32_FLASH_SECBB1R8   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB1R8_OFFSET)
#define STM32_FLASH_SECBB2R1   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R1_OFFSET)
#define STM32_FLASH_SECBB2R2   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R2_OFFSET)
#define STM32_FLASH_SECBB2R3   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R3_OFFSET)
#define STM32_FLASH_SECBB2R4   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R4_OFFSET)
#define STM32_FLASH_SECBB2R5   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R5_OFFSET)
#define STM32_FLASH_SECBB2R6   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R6_OFFSET)
#define STM32_FLASH_SECBB2R7   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R7_OFFSET)
#define STM32_FLASH_SECBB2R8   (STM32_FLASHIF_BASE + STM32_FLASH_SECBB2R8_OFFSET)
#define STM32_FLASH_SECHDPCR   (STM32_FLASHIF_BASE + STM32_FLASH_SECHDPCR_OFFSET)
#define STM32_FLASH_PRIVCFGR   (STM32_FLASHIF_BASE + STM32_FLASH_PRIVCFGR_OFFSET)
#define STM32_FLASH_SECHDPEXTR (STM32_FLASHIF_BASE + STM32_FLASH_SECHDPEXTR_OFFSET)
#define STM32_FLASH_PRIVBB1R1  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R1_OFFSET)
#define STM32_FLASH_PRIVBB1R2  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R2_OFFSET)
#define STM32_FLASH_PRIVBB1R3  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R3_OFFSET)
#define STM32_FLASH_PRIVBB1R4  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R4_OFFSET)
#define STM32_FLASH_PRIVBB1R5  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R5_OFFSET)
#define STM32_FLASH_PRIVBB1R6  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R6_OFFSET)
#define STM32_FLASH_PRIVBB1R7  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R7_OFFSET)
#define STM32_FLASH_PRIVBB1R8  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB1R8_OFFSET)
#define STM32_FLASH_PRIVBB2R1  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R1_OFFSET)
#define STM32_FLASH_PRIVBB2R2  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R2_OFFSET)
#define STM32_FLASH_PRIVBB2R3  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R3_OFFSET)
#define STM32_FLASH_PRIVBB2R4  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R4_OFFSET)
#define STM32_FLASH_PRIVBB2R5  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R5_OFFSET)
#define STM32_FLASH_PRIVBB2R6  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R6_OFFSET)
#define STM32_FLASH_PRIVBB2R7  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R7_OFFSET)
#define STM32_FLASH_PRIVBB2R8  (STM32_FLASHIF_BASE + STM32_FLASH_PRIVBB2R8_OFFSET)
#define STM32_FLASH_OEM1KEYR1  (STM32_FLASHIF_BASE + STM32_FLASH_OEM1KEYR1_OFFSET)
#define STM32_FLASH_OEM1KEYR2  (STM32_FLASHIF_BASE + STM32_FLASH_OEM1KEYR2_OFFSET)
#define STM32_FLASH_OEM1KEYR3  (STM32_FLASHIF_BASE + STM32_FLASH_OEM1KEYR3_OFFSET)
#define STM32_FLASH_OEM1KEYR4  (STM32_FLASHIF_BASE + STM32_FLASH_OEM1KEYR4_OFFSET)
#define STM32_FLASH_OEM2KEYR1  (STM32_FLASHIF_BASE + STM32_FLASH_OEM2KEYR1_OFFSET)
#define STM32_FLASH_OEM2KEYR2  (STM32_FLASHIF_BASE + STM32_FLASH_OEM2KEYR2_OFFSET)
#define STM32_FLASH_OEM2KEYR3  (STM32_FLASHIF_BASE + STM32_FLASH_OEM2KEYR3_OFFSET)
#define STM32_FLASH_OEM2KEYR4  (STM32_FLASHIF_BASE + STM32_FLASH_OEM2KEYR4_OFFSET)
#define STM32_FLASH_OEMKEYSR   (STM32_FLASHIF_BASE + STM32_FLASH_OEMKEYSR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* FLASH access control register */

#define FLASH_ACR_LATENCY_SHIFT             (0)
#define FLASH_ACR_LATENCY_MASK              (0xf << FLASH_ACR_LATENCY_SHIFT)
#define FLASH_ACR_LATENCY(n)                ((n) << FLASH_ACR_LATENCY_SHIFT)
#  define FLASH_ACR_LATENCY_0               FLASH_ACR_LATENCY(0)
#  define FLASH_ACR_LATENCY_1               FLASH_ACR_LATENCY(1)
#  define FLASH_ACR_LATENCY_2               FLASH_ACR_LATENCY(2)
#  define FLASH_ACR_LATENCY_3               FLASH_ACR_LATENCY(3)
#  define FLASH_ACR_LATENCY_4               FLASH_ACR_LATENCY(4)
#  define FLASH_ACR_LATENCY_5               FLASH_ACR_LATENCY(5)
#  define FLASH_ACR_LATENCY_6               FLASH_ACR_LATENCY(6)
#  define FLASH_ACR_LATENCY_7               FLASH_ACR_LATENCY(7)
#  define FLASH_ACR_LATENCY_8               FLASH_ACR_LATENCY(8)
#  define FLASH_ACR_LATENCY_9               FLASH_ACR_LATENCY(9)
#  define FLASH_ACR_LATENCY_10              FLASH_ACR_LATENCY(10)
#  define FLASH_ACR_LATENCY_11              FLASH_ACR_LATENCY(11)
#  define FLASH_ACR_LATENCY_12              FLASH_ACR_LATENCY(12)
#  define FLASH_ACR_LATENCY_13              FLASH_ACR_LATENCY(13)
#  define FLASH_ACR_LATENCY_14              FLASH_ACR_LATENCY(14)
#  define FLASH_ACR_LATENCY_15              FLASH_ACR_LATENCY(15)
#define FLASH_ACR_PRFTEN                    (1 << 8)
#define FLASH_ACR_LPM                       (1 << 11)
#define FLASH_ACR_PDREQ1                    (1 << 12)
#define FLASH_ACR_PDREQ2                    (1 << 13)
#define FLASH_ACR_SLEEP_PD                  (1 << 14)

/* FLASH non-secure key register */

#define FLASH_KEYR_KEY_SHIFT                (0)
#define FLASH_KEYR_KEY_MASK                 (0xffffffff << FLASH_KEYR_KEY_SHIFT)
#define FLASH_KEYR_KEY(n)                   ((n) << FLASH_KEYR_KEY_SHIFT)
#  define FLASH_KEYR_KEY1                   FLASH_KEYR_KEY(0x45670123)
#  define FLASH_KEYR_KEY2                   FLASH_KEYR_KEY(0xcdef89ab)

/* FLASH secure key register */

