apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
#define FLASH_SKEYR_KEY_SHIFT               (0)
#define FLASH_SKEYR_KEY_MASK                (0xffffffff << FLASH_SKEYR_KEY_SHIFT)
#define FLASH_SKEYR_KEY(n)                  ((n) << FLASH_SKEYR_KEY_SHIFT)
#  define FLASH_SKEYR_KEY1                  FLASH_SKEYR_KEY(0x45670123)
#  define FLASH_SKEYR_KEY2                  FLASH_SKEYR_KEY(0xcdef89ab)

/* FLASH option key register */

#define FLASH_OPTKEYR_KEY_SHIFT             (0)
#define FLASH_OPTKEYR_KEY_MASK              (0xffffffff << FLASH_OPTKEYR_KEY_SHIFT)
#define FLASH_OPTKEYR_KEY(n)                ((n) << FLASH_OPTKEYR_KEY_SHIFT)
#  define FLASH_OPTKEYR_KEY1                FLASH_OPTKEYR_KEY(0x08192a3b)
#  define FLASH_OPTKEYR_KEY2                FLASH_OPTKEYR_KEY(0x4c5d6e7f)

/* FLASH bank 1 power-down key register */

#define FLASH_PDKEY1R_KEY1_SHIFT            (0)
#define FLASH_PDKEY1R_KEY1_MASK             (0xffffffff << FLASH_PDKEY1R_KEY1_SHIFT)
#define FLASH_PDKEY1R_KEY1(n)               ((n) << FLASH_PDKEY1R_KEY1_SHIFT)
#  define FLASH_PDKEY1R_KEY1_1              FLASH_PDKEY1R_KEY1(0x04152637)
#  define FLASH_PDKEY1R_KEY1_2              FLASH_PDKEY1R_KEY1(0xfafbfcfd)

/* FLASH bank 2 power-down key register */

#define FLASH_PDKEY2R_KEY2_SHIFT            (0)
#define FLASH_PDKEY2R_KEY2_MASK             (0xffffffff << FLASH_PDKEY2R_KEY2_SHIFT)
#define FLASH_PDKEY2R_KEY2(n)               ((n) << FLASH_PDKEY2R_KEY2_SHIFT)
#  define FLASH_PDKEY2R_KEY2_1              FLASH_PDKEY2R_KEY2(0x40516273)
#  define FLASH_PDKEY2R_KEY2_2              FLASH_PDKEY2R_KEY2(0xafbfcfdf)

/* FLASH non-secure status register */

#define FLASH_SR_EOP                        (1 << 0)
#define FLASH_SR_OPERR                      (1 << 1)
#define FLASH_SR_PROGERR                    (1 << 3)
#define FLASH_SR_WRPERR                     (1 << 4)
#define FLASH_SR_PGAERR                     (1 << 5)
#define FLASH_SR_SIZERR                     (1 << 6)
#define FLASH_SR_PGSERR                     (1 << 7)
#define FLASH_SR_OPTWERR                    (1 << 13)
#define FLASH_SR_BSY                        (1 << 16)
#define FLASH_SR_WDW                        (1 << 17)
#define FLASH_SR_OEM1LOCK                   (1 << 18)
#define FLASH_SR_OEM2LOCK                   (1 << 19)
#define FLASH_SR_PD1                        (1 << 20)
#define FLASH_SR_PD2                        (1 << 21)

/* FLASH secure status register */

#define FLASH_SSR_EOP                       (1 << 0)
#define FLASH_SSR_OPERR                     (1 << 1)
#define FLASH_SSR_PROGERR                   (1 << 3)
#define FLASH_SSR_WRPERR                    (1 << 4)
#define FLASH_SSR_PGAERR                    (1 << 5)
#define FLASH_SSR_SIZERR                    (1 << 6)
#define FLASH_SSR_PGSERR                    (1 << 7)
#define FLASH_SSR_BSY                       (1 << 16)
#define FLASH_SSR_WDW                       (1 << 17)

/* FLASH non-secure control register */

#define FLASH_CR_PG                         (1 << 0)
#define FLASH_CR_PER                        (1 << 1)
#define FLASH_CR_MER1                       (1 << 2)
#define FLASH_CR_PNB_SHIFT                  (3)
#define FLASH_CR_PNB_MASK                   (0xff << FLASH_CR_PNB_SHIFT)
#define FLASH_CR_PNB(n)                     ((n) << FLASH_CR_PNB_SHIFT)
#define FLASH_CR_BKER                       (1 << 11)
#define FLASH_CR_BWR                        (1 << 14)
#define FLASH_CR_MER2                       (1 << 15)
#define FLASH_CR_STRT                       (1 << 16)
#define FLASH_CR_OPTSTRT                    (1 << 17)
#define FLASH_CR_EOPIE                      (1 << 24)
#define FLASH_CR_ERRIE                      (1 << 25)
#define FLASH_CR_OBL_LAUNCH                 (1 << 27)
#define FLASH_CR_OPTLOCK                    (1 << 30)
#define FLASH_CR_LOCK                       (1 << 31)

/* FLASH secure control register */

#define FLASH_SCR_PG                        (1 << 0)
#define FLASH_SCR_PER                       (1 << 1)
#define FLASH_SCR_MER1                      (1 << 2)
#define FLASH_SCR_PNB_SHIFT                 (3)
#define FLASH_SCR_PNB_MASK                  (0xff << FLASH_SCR_PNB_SHIFT)
#define FLASH_SCR_PNB(n)                    ((n) << FLASH_SCR_PNB_SHIFT)
#define FLASH_SCR_BKER                      (1 << 11)
#define FLASH_SCR_BWR                       (1 << 14)
#define FLASH_SCR_MER2                      (1 << 15)
#define FLASH_SCR_STRT                      (1 << 16)
#define FLASH_SCR_EOPIE                     (1 << 24)
#define FLASH_SCR_ERRIE                     (1 << 25)
#define FLASH_SCR_INV                       (1 << 29)
#define FLASH_SCR_LOCK                      (1 << 31)

/* FLASH ECC correction register */

#define FLASH_ECCCR_ADDR_ECC_SHIFT          (0)
#define FLASH_ECCCR_ADDR_ECC_MASK           (0xfffff << FLASH_ECCCR_ADDR_ECC_SHIFT)
#define FLASH_ECCCR_ADDR_ECC(n)             ((n) << FLASH_ECCCR_ADDR_ECC_SHIFT)
#define FLASH_ECCCR_BK_ECC                  (1 << 21)
#define FLASH_ECCCR_SYSF_ECC                (1 << 22)
#define FLASH_ECCCR_ECCIE                   (1 << 24)
#define FLASH_ECCCR_ECCC                    (1 << 30)

/* FLASH ECC detection register */

#define FLASH_ECCDR_ADDR_ECC_SHIFT          (0)
#define FLASH_ECCDR_ADDR_ECC_MASK           (0xfffff << FLASH_ECCDR_ADDR_ECC_SHIFT)
#define FLASH_ECCDR_ADDR_ECC(n)             ((n) << FLASH_ECCDR_ADDR_ECC_SHIFT)
#define FLASH_ECCDR_BK_ECC                  (1 << 21)
#define FLASH_ECCDR_SYSF_ECC                (1 << 22)
#define FLASH_ECCDR_ECCD                    (1 << 31)

/* FLASH OPSR register */

#define FLASH_OPSR_ADDR_OP_SHIFT            (0)
#define FLASH_OPSR_ADDR_OP_MASK             (0xfffff << FLASH_OPSR_ADDR_OP_SHIFT)
#define FLASH_OPSR_ADDR_OP(n)               ((n) << FLASH_OPSR_ADDR_OP_SHIFT)
#define FLASH_OPSR_BK_OP                    (1 << 21)
#define FLASH_OPSR_SYSF_OP                  (1 << 22)
#define FLASH_OPSR_CODE_OP_SHIFT            (29)
#define FLASH_OPSR_CODE_OP_MASK             (0x7 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP(n)               ((n) << FLASH_OPSR_CODE_OP_SHIFT)
#  define FLASH_OPSR_CODE_OP_NONE           FLASH_OPSR_CODE_OP(0)
#  define FLASH_OPSR_CODE_OP_DOUBLEWORD     FLASH_OPSR_CODE_OP(1)
#  define FLASH_OPSR_CODE_OP_BURST          FLASH_OPSR_CODE_OP(2)
#  define FLASH_OPSR_CODE_OP_PAGE_ERASE     FLASH_OPSR_CODE_OP(3)
#  define FLASH_OPSR_CODE_OP_BANK_ERASE     FLASH_OPSR_CODE_OP(4)
#  define FLASH_OPSR_CODE_OP_MASS_ERASE     FLASH_OPSR_CODE_OP(5)
#  define FLASH_OPSR_CODE_OP_OPTION_CHANGE  FLASH_OPSR_CODE_OP(6)

/* FLASH option control register */

#define FLASH_OPTR_RDP_SHIFT                (0)
#define FLASH_OPTR_RDP_MASK                 (0xff << FLASH_OPTR_RDP_SHIFT)
#define FLASH_OPTR_RDP(n)                   ((n) << FLASH_OPTR_RDP_SHIFT)
#  define FLASH_OPTR_RDP_LEVEL_0            FLASH_OPTR_RDP(0xaa)
#  define FLASH_OPTR_RDP_LEVEL_0_5          FLASH_OPTR_RDP(0x55)
#  define FLASH_OPTR_RDP_LEVEL_1            FLASH_OPTR_RDP(0xbb)
#  define FLASH_OPTR_RDP_LEVEL_2            FLASH_OPTR_RDP(0xcc)
#define FLASH_OPTR_BOR_LEV_SHIFT            (8)
#define FLASH_OPTR_BOR_LEV_MASK             (0x7 << FLASH_OPTR_BOR_LEV_SHIFT)
#define FLASH_OPTR_BOR_LEV(n)               ((n) << FLASH_OPTR_BOR_LEV_SHIFT)
#  define FLASH_OPTR_BOR_LEVEL_0            FLASH_OPTR_BOR_LEV(0)
#  define FLASH_OPTR_BOR_LEVEL_1            FLASH_OPTR_BOR_LEV(1)
#  define FLASH_OPTR_BOR_LEVEL_2            FLASH_OPTR_BOR_LEV(2)
#  define FLASH_OPTR_BOR_LEVEL_3            FLASH_OPTR_BOR_LEV(3)
#  define FLASH_OPTR_BOR_LEVEL_4            FLASH_OPTR_BOR_LEV(4)
#define FLASH_OPTR_BDRST_POR                (1 << 11)
#define FLASH_OPTR_NRST_STOP                (1 << 12)
#define FLASH_OPTR_NRST_STDBY               (1 << 13)
#define FLASH_OPTR_NRST_SHDW                (1 << 14)
#define FLASH_OPTR_SRAM1_RST                (1 << 15)
#define FLASH_OPTR_IWDG_SW                  (1 << 16)
#define FLASH_OPTR_IWDG_STOP                (1 << 17)
#define FLASH_OPTR_IWDG_STDBY               (1 << 18)
#define FLASH_OPTR_WWDG_SW                  (1 << 19)
#define FLASH_OPTR_SWAP_BANK                (1 << 20)
#define FLASH_OPTR_DUALBANK                 (1 << 21)
#define FLASH_OPTR_SRAM3_PE                 (1 << 23)
#define FLASH_OPTR_SRAM2_PE                 (1 << 24)
#define FLASH_OPTR_SRAM2_RST                (1 << 25)
#define FLASH_OPTR_NSWBOOT0                 (1 << 26)
#define FLASH_OPTR_NBOOT0                   (1 << 27)
#define FLASH_OPTR_IO_VDD_HSLV              (1 << 29)
#define FLASH_OPTR_IO_VDDIO2_HSLV           (1 << 30)
#define FLASH_OPTR_TZEN                     (1 << 31)

/* FLASH non-secure boot address 0 register */

#define FLASH_BOOT0R_ADD_SHIFT              (7)
#define FLASH_BOOT0R_ADD_MASK               (0x1ffffff << FLASH_BOOT0R_ADD_SHIFT)
#define FLASH_BOOT0R_ADD(n)                 ((n) << FLASH_BOOT0R_ADD_SHIFT)

/* FLASH non-secure boot address 1 register */

#define FLASH_BOOT1R_ADD_SHIFT              (7)
#define FLASH_BOOT1R_ADD_MASK               (0x1ffffff << FLASH_BOOT1R_ADD_SHIFT)
#define FLASH_BOOT1R_ADD(n)                 ((n) << FLASH_BOOT1R_ADD_SHIFT)

/* FLASH secure boot address 0 register */

#define FLASH_SBOOT0R_BOOT_LOCK             (1 << 0)
#define FLASH_SBOOT0R_ADD_SHIFT             (7)
#define FLASH_SBOOT0R_ADD_MASK              (0x1ffffff << FLASH_SBOOT0R_ADD_SHIFT)
#define FLASH_SBOOT0R_ADD(n)                ((n) << FLASH_SBOOT0R_ADD_SHIFT)

/* FLASH secure watermark1 register 1 */

#define FLASH_SECWM1R1_SECWM1_STRT_SHIFT    (0)
#define FLASH_SECWM1R1_SECWM1_STRT_MASK     (0xff << FLASH_SECWM1R1_SECWM1_STRT_SHIFT)
#define FLASH_SECWM1R1_SECWM1_STRT(n)       ((n) << FLASH_SECWM1R1_SECWM1_STRT_SHIFT)
#define FLASH_SECWM1R1_SECWM1_END_SHIFT     (16)
#define FLASH_SECWM1R1_SECWM1_END_MASK      (0xff << FLASH_SECWM1R1_SECWM1_END_SHIFT)
#define FLASH_SECWM1R1_SECWM1_END(n)        ((n) << FLASH_SECWM1R1_SECWM1_END_SHIFT)

