apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
/* FLASH secure watermark1 register 2 */

#define FLASH_SECWM1R2_HDP1_END_SHIFT       (16)
#define FLASH_SECWM1R2_HDP1_END_MASK        (0xff << FLASH_SECWM1R2_HDP1_END_SHIFT)
#define FLASH_SECWM1R2_HDP1_END(n)          ((n) << FLASH_SECWM1R2_HDP1_END_SHIFT)
#define FLASH_SECWM1R2_HDP1EN_SHIFT         (24)
#define FLASH_SECWM1R2_HDP1EN_MASK          (0xff << FLASH_SECWM1R2_HDP1EN_SHIFT)
#define FLASH_SECWM1R2_HDP1EN(n)            ((n) << FLASH_SECWM1R2_HDP1EN_SHIFT)

/* FLASH WRP1 area A address register */

#define FLASH_WRP1AR_STRT_SHIFT             (0)
#define FLASH_WRP1AR_STRT_MASK              (0xff << FLASH_WRP1AR_STRT_SHIFT)
#define FLASH_WRP1AR_STRT(n)                ((n) << FLASH_WRP1AR_STRT_SHIFT)
#define FLASH_WRP1AR_END_SHIFT              (16)
#define FLASH_WRP1AR_END_MASK               (0xff << FLASH_WRP1AR_END_SHIFT)
#define FLASH_WRP1AR_END(n)                 ((n) << FLASH_WRP1AR_END_SHIFT)
#define FLASH_WRP1AR_UNLOCK                 (1 << 31)

/* FLASH WRP1 area B address register */

#define FLASH_WRP1BR_STRT_SHIFT             (0)
#define FLASH_WRP1BR_STRT_MASK              (0xff << FLASH_WRP1BR_STRT_SHIFT)
#define FLASH_WRP1BR_STRT(n)                ((n) << FLASH_WRP1BR_STRT_SHIFT)
#define FLASH_WRP1BR_END_SHIFT              (16)
#define FLASH_WRP1BR_END_MASK               (0xff << FLASH_WRP1BR_END_SHIFT)
#define FLASH_WRP1BR_END(n)                 ((n) << FLASH_WRP1BR_END_SHIFT)
#define FLASH_WRP1BR_UNLOCK                 (1 << 31)

/* FLASH secure watermark2 register 1 */

#define FLASH_SECWM2R1_SECWM2_STRT_SHIFT    (0)
#define FLASH_SECWM2R1_SECWM2_STRT_MASK     (0xff << FLASH_SECWM2R1_SECWM2_STRT_SHIFT)
#define FLASH_SECWM2R1_SECWM2_STRT(n)       ((n) << FLASH_SECWM2R1_SECWM2_STRT_SHIFT)
#define FLASH_SECWM2R1_SECWM2_END_SHIFT     (16)
#define FLASH_SECWM2R1_SECWM2_END_MASK      (0xff << FLASH_SECWM2R1_SECWM2_END_SHIFT)
#define FLASH_SECWM2R1_SECWM2_END(n)        ((n) << FLASH_SECWM2R1_SECWM2_END_SHIFT)

/* FLASH secure watermark2 register 2 */

#define FLASH_SECWM2R2_HDP2_END_SHIFT       (16)
#define FLASH_SECWM2R2_HDP2_END_MASK        (0xff << FLASH_SECWM2R2_HDP2_END_SHIFT)
#define FLASH_SECWM2R2_HDP2_END(n)          ((n) << FLASH_SECWM2R2_HDP2_END_SHIFT)
#define FLASH_SECWM2R2_HDP2EN_SHIFT         (24)
#define FLASH_SECWM2R2_HDP2EN_MASK          (0xff << FLASH_SECWM2R2_HDP2EN_SHIFT)
#define FLASH_SECWM2R2_HDP2EN(n)            ((n) << FLASH_SECWM2R2_HDP2EN_SHIFT)

/* FLASH WRP2 area A address register */

#define FLASH_WRP2AR_STRT_SHIFT             (0)
#define FLASH_WRP2AR_STRT_MASK              (0xff << FLASH_WRP2AR_STRT_SHIFT)
#define FLASH_WRP2AR_STRT(n)                ((n) << FLASH_WRP2AR_STRT_SHIFT)
#define FLASH_WRP2AR_END_SHIFT              (16)
#define FLASH_WRP2AR_END_MASK               (0xff << FLASH_WRP2AR_END_SHIFT)
#define FLASH_WRP2AR_END(n)                 ((n) << FLASH_WRP2AR_END_SHIFT)
#define FLASH_WRP2AR_UNLOCK                 (1 << 31)

/* FLASH WRP2 area B address register */

#define FLASH_WRP2BR_STRT_SHIFT             (0)
#define FLASH_WRP2BR_STRT_MASK              (0xff << FLASH_WRP2BR_STRT_SHIFT)
#define FLASH_WRP2BR_STRT(n)                ((n) << FLASH_WRP2BR_STRT_SHIFT)
#define FLASH_WRP2BR_END_SHIFT              (16)
#define FLASH_WRP2BR_END_MASK               (0xff << FLASH_WRP2BR_END_SHIFT)
#define FLASH_WRP2BR_END(n)                 ((n) << FLASH_WRP2BR_END_SHIFT)
#define FLASH_WRP2BR_UNLOCK                 (1 << 31)

/* FLASH secure block-based bank 1 register 1 */

#define FLASH_SECBB1R1_SEC0                 (1 << 0)
#define FLASH_SECBB1R1_SEC1                 (1 << 1)
#define FLASH_SECBB1R1_SEC2                 (1 << 2)
#define FLASH_SECBB1R1_SEC3                 (1 << 3)
#define FLASH_SECBB1R1_SEC4                 (1 << 4)
#define FLASH_SECBB1R1_SEC5                 (1 << 5)
#define FLASH_SECBB1R1_SEC6                 (1 << 6)
#define FLASH_SECBB1R1_SEC7                 (1 << 7)
#define FLASH_SECBB1R1_SEC8                 (1 << 8)
#define FLASH_SECBB1R1_SEC9                 (1 << 9)
#define FLASH_SECBB1R1_SEC10                (1 << 10)
#define FLASH_SECBB1R1_SEC11                (1 << 11)
#define FLASH_SECBB1R1_SEC12                (1 << 12)
#define FLASH_SECBB1R1_SEC13                (1 << 13)
#define FLASH_SECBB1R1_SEC14                (1 << 14)
#define FLASH_SECBB1R1_SEC15                (1 << 15)
#define FLASH_SECBB1R1_SEC16                (1 << 16)
#define FLASH_SECBB1R1_SEC17                (1 << 17)
#define FLASH_SECBB1R1_SEC18                (1 << 18)
#define FLASH_SECBB1R1_SEC19                (1 << 19)
#define FLASH_SECBB1R1_SEC20                (1 << 20)
#define FLASH_SECBB1R1_SEC21                (1 << 21)
#define FLASH_SECBB1R1_SEC22                (1 << 22)
#define FLASH_SECBB1R1_SEC23                (1 << 23)
#define FLASH_SECBB1R1_SEC24                (1 << 24)
#define FLASH_SECBB1R1_SEC25                (1 << 25)
#define FLASH_SECBB1R1_SEC26                (1 << 26)
#define FLASH_SECBB1R1_SEC27                (1 << 27)
#define FLASH_SECBB1R1_SEC28                (1 << 28)
#define FLASH_SECBB1R1_SEC29                (1 << 29)
#define FLASH_SECBB1R1_SEC30                (1 << 30)
#define FLASH_SECBB1R1_SEC31                (1 << 31)

/* FLASH secure block-based bank 1 register 2 */

#define FLASH_SECBB1R2_SEC0                 (1 << 0)
#define FLASH_SECBB1R2_SEC1                 (1 << 1)
#define FLASH_SECBB1R2_SEC2                 (1 << 2)
#define FLASH_SECBB1R2_SEC3                 (1 << 3)
#define FLASH_SECBB1R2_SEC4                 (1 << 4)
#define FLASH_SECBB1R2_SEC5                 (1 << 5)
#define FLASH_SECBB1R2_SEC6                 (1 << 6)
#define FLASH_SECBB1R2_SEC7                 (1 << 7)
#define FLASH_SECBB1R2_SEC8                 (1 << 8)
#define FLASH_SECBB1R2_SEC9                 (1 << 9)
#define FLASH_SECBB1R2_SEC10                (1 << 10)
#define FLASH_SECBB1R2_SEC11                (1 << 11)
#define FLASH_SECBB1R2_SEC12                (1 << 12)
#define FLASH_SECBB1R2_SEC13                (1 << 13)
#define FLASH_SECBB1R2_SEC14                (1 << 14)
#define FLASH_SECBB1R2_SEC15                (1 << 15)
#define FLASH_SECBB1R2_SEC16                (1 << 16)
#define FLASH_SECBB1R2_SEC17                (1 << 17)
#define FLASH_SECBB1R2_SEC18                (1 << 18)
#define FLASH_SECBB1R2_SEC19                (1 << 19)
#define FLASH_SECBB1R2_SEC20                (1 << 20)
#define FLASH_SECBB1R2_SEC21                (1 << 21)
#define FLASH_SECBB1R2_SEC22                (1 << 22)
#define FLASH_SECBB1R2_SEC23                (1 << 23)
#define FLASH_SECBB1R2_SEC24                (1 << 24)
#define FLASH_SECBB1R2_SEC25                (1 << 25)
#define FLASH_SECBB1R2_SEC26                (1 << 26)
#define FLASH_SECBB1R2_SEC27                (1 << 27)
#define FLASH_SECBB1R2_SEC28                (1 << 28)
#define FLASH_SECBB1R2_SEC29                (1 << 29)
#define FLASH_SECBB1R2_SEC30                (1 << 30)
#define FLASH_SECBB1R2_SEC31                (1 << 31)

/* FLASH secure block-based bank 1 register 3 */

#define FLASH_SECBB1R3_SEC0                 (1 << 0)
#define FLASH_SECBB1R3_SEC1                 (1 << 1)
#define FLASH_SECBB1R3_SEC2                 (1 << 2)
#define FLASH_SECBB1R3_SEC3                 (1 << 3)
#define FLASH_SECBB1R3_SEC4                 (1 << 4)
#define FLASH_SECBB1R3_SEC5                 (1 << 5)
#define FLASH_SECBB1R3_SEC6                 (1 << 6)
#define FLASH_SECBB1R3_SEC7                 (1 << 7)
#define FLASH_SECBB1R3_SEC8                 (1 << 8)
#define FLASH_SECBB1R3_SEC9                 (1 << 9)
#define FLASH_SECBB1R3_SEC10                (1 << 10)
#define FLASH_SECBB1R3_SEC11                (1 << 11)
#define FLASH_SECBB1R3_SEC12                (1 << 12)
#define FLASH_SECBB1R3_SEC13                (1 << 13)
#define FLASH_SECBB1R3_SEC14                (1 << 14)
#define FLASH_SECBB1R3_SEC15                (1 << 15)
#define FLASH_SECBB1R3_SEC16                (1 << 16)
#define FLASH_SECBB1R3_SEC17                (1 << 17)
#define FLASH_SECBB1R3_SEC18                (1 << 18)
#define FLASH_SECBB1R3_SEC19                (1 << 19)
#define FLASH_SECBB1R3_SEC20                (1 << 20)
#define FLASH_SECBB1R3_SEC21                (1 << 21)
#define FLASH_SECBB1R3_SEC22                (1 << 22)
#define FLASH_SECBB1R3_SEC23                (1 << 23)
#define FLASH_SECBB1R3_SEC24                (1 << 24)
#define FLASH_SECBB1R3_SEC25                (1 << 25)
#define FLASH_SECBB1R3_SEC26                (1 << 26)
#define FLASH_SECBB1R3_SEC27                (1 << 27)
#define FLASH_SECBB1R3_SEC28                (1 << 28)
#define FLASH_SECBB1R3_SEC29                (1 << 29)
#define FLASH_SECBB1R3_SEC30                (1 << 30)
#define FLASH_SECBB1R3_SEC31                (1 << 31)

/* FLASH secure block-based bank 1 register 4 */

#define FLASH_SECBB1R4_SEC0                 (1 << 0)
#define FLASH_SECBB1R4_SEC1                 (1 << 1)
#define FLASH_SECBB1R4_SEC2                 (1 << 2)
#define FLASH_SECBB1R4_SEC3                 (1 << 3)
#define FLASH_SECBB1R4_SEC4                 (1 << 4)
#define FLASH_SECBB1R4_SEC5                 (1 << 5)
#define FLASH_SECBB1R4_SEC6                 (1 << 6)
#define FLASH_SECBB1R4_SEC7                 (1 << 7)
#define FLASH_SECBB1R4_SEC8                 (1 << 8)
#define FLASH_SECBB1R4_SEC9                 (1 << 9)
#define FLASH_SECBB1R4_SEC10                (1 << 10)
#define FLASH_SECBB1R4_SEC11                (1 << 11)
#define FLASH_SECBB1R4_SEC12                (1 << 12)
#define FLASH_SECBB1R4_SEC13                (1 << 13)
#define FLASH_SECBB1R4_SEC14                (1 << 14)
#define FLASH_SECBB1R4_SEC15                (1 << 15)
#define FLASH_SECBB1R4_SEC16                (1 << 16)
#define FLASH_SECBB1R4_SEC17                (1 << 17)
#define FLASH_SECBB1R4_SEC18                (1 << 18)
#define FLASH_SECBB1R4_SEC19                (1 << 19)
#define FLASH_SECBB1R4_SEC20                (1 << 20)
#define FLASH_SECBB1R4_SEC21                (1 << 21)
#define FLASH_SECBB1R4_SEC22                (1 << 22)
#define FLASH_SECBB1R4_SEC23                (1 << 23)
#define FLASH_SECBB1R4_SEC24                (1 << 24)
#define FLASH_SECBB1R4_SEC25                (1 << 25)
#define FLASH_SECBB1R4_SEC26                (1 << 26)
#define FLASH_SECBB1R4_SEC27                (1 << 27)
#define FLASH_SECBB1R4_SEC28                (1 << 28)
#define FLASH_SECBB1R4_SEC29                (1 << 29)
#define FLASH_SECBB1R4_SEC30                (1 << 30)
#define FLASH_SECBB1R4_SEC31                (1 << 31)

/* FLASH secure block-based bank 1 register 5 */

