apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
#define FLASH_SECBB1R5_SEC0                 (1 << 0)
#define FLASH_SECBB1R5_SEC1                 (1 << 1)
#define FLASH_SECBB1R5_SEC2                 (1 << 2)
#define FLASH_SECBB1R5_SEC3                 (1 << 3)
#define FLASH_SECBB1R5_SEC4                 (1 << 4)
#define FLASH_SECBB1R5_SEC5                 (1 << 5)
#define FLASH_SECBB1R5_SEC6                 (1 << 6)
#define FLASH_SECBB1R5_SEC7                 (1 << 7)
#define FLASH_SECBB1R5_SEC8                 (1 << 8)
#define FLASH_SECBB1R5_SEC9                 (1 << 9)
#define FLASH_SECBB1R5_SEC10                (1 << 10)
#define FLASH_SECBB1R5_SEC11                (1 << 11)
#define FLASH_SECBB1R5_SEC12                (1 << 12)
#define FLASH_SECBB1R5_SEC13                (1 << 13)
#define FLASH_SECBB1R5_SEC14                (1 << 14)
#define FLASH_SECBB1R5_SEC15                (1 << 15)
#define FLASH_SECBB1R5_SEC16                (1 << 16)
#define FLASH_SECBB1R5_SEC17                (1 << 17)
#define FLASH_SECBB1R5_SEC18                (1 << 18)
#define FLASH_SECBB1R5_SEC19                (1 << 19)
#define FLASH_SECBB1R5_SEC20                (1 << 20)
#define FLASH_SECBB1R5_SEC21                (1 << 21)
#define FLASH_SECBB1R5_SEC22                (1 << 22)
#define FLASH_SECBB1R5_SEC23                (1 << 23)
#define FLASH_SECBB1R5_SEC24                (1 << 24)
#define FLASH_SECBB1R5_SEC25                (1 << 25)
#define FLASH_SECBB1R5_SEC26                (1 << 26)
#define FLASH_SECBB1R5_SEC27                (1 << 27)
#define FLASH_SECBB1R5_SEC28                (1 << 28)
#define FLASH_SECBB1R5_SEC29                (1 << 29)
#define FLASH_SECBB1R5_SEC30                (1 << 30)
#define FLASH_SECBB1R5_SEC31                (1 << 31)

/* FLASH secure block-based bank 1 register 6 */

#define FLASH_SECBB1R6_SEC0                 (1 << 0)
#define FLASH_SECBB1R6_SEC1                 (1 << 1)
#define FLASH_SECBB1R6_SEC2                 (1 << 2)
#define FLASH_SECBB1R6_SEC3                 (1 << 3)
#define FLASH_SECBB1R6_SEC4                 (1 << 4)
#define FLASH_SECBB1R6_SEC5                 (1 << 5)
#define FLASH_SECBB1R6_SEC6                 (1 << 6)
#define FLASH_SECBB1R6_SEC7                 (1 << 7)
#define FLASH_SECBB1R6_SEC8                 (1 << 8)
#define FLASH_SECBB1R6_SEC9                 (1 << 9)
#define FLASH_SECBB1R6_SEC10                (1 << 10)
#define FLASH_SECBB1R6_SEC11                (1 << 11)
#define FLASH_SECBB1R6_SEC12                (1 << 12)
#define FLASH_SECBB1R6_SEC13                (1 << 13)
#define FLASH_SECBB1R6_SEC14                (1 << 14)
#define FLASH_SECBB1R6_SEC15                (1 << 15)
#define FLASH_SECBB1R6_SEC16                (1 << 16)
#define FLASH_SECBB1R6_SEC17                (1 << 17)
#define FLASH_SECBB1R6_SEC18                (1 << 18)
#define FLASH_SECBB1R6_SEC19                (1 << 19)
#define FLASH_SECBB1R6_SEC20                (1 << 20)
#define FLASH_SECBB1R6_SEC21                (1 << 21)
#define FLASH_SECBB1R6_SEC22                (1 << 22)
#define FLASH_SECBB1R6_SEC23                (1 << 23)
#define FLASH_SECBB1R6_SEC24                (1 << 24)
#define FLASH_SECBB1R6_SEC25                (1 << 25)
#define FLASH_SECBB1R6_SEC26                (1 << 26)
#define FLASH_SECBB1R6_SEC27                (1 << 27)
#define FLASH_SECBB1R6_SEC28                (1 << 28)
#define FLASH_SECBB1R6_SEC29                (1 << 29)
#define FLASH_SECBB1R6_SEC30                (1 << 30)
#define FLASH_SECBB1R6_SEC31                (1 << 31)

/* FLASH secure block-based bank 1 register 7 */

#define FLASH_SECBB1R7_SEC0                 (1 << 0)
#define FLASH_SECBB1R7_SEC1                 (1 << 1)
#define FLASH_SECBB1R7_SEC2                 (1 << 2)
#define FLASH_SECBB1R7_SEC3                 (1 << 3)
#define FLASH_SECBB1R7_SEC4                 (1 << 4)
#define FLASH_SECBB1R7_SEC5                 (1 << 5)
#define FLASH_SECBB1R7_SEC6                 (1 << 6)
#define FLASH_SECBB1R7_SEC7                 (1 << 7)
#define FLASH_SECBB1R7_SEC8                 (1 << 8)
#define FLASH_SECBB1R7_SEC9                 (1 << 9)
#define FLASH_SECBB1R7_SEC10                (1 << 10)
#define FLASH_SECBB1R7_SEC11                (1 << 11)
#define FLASH_SECBB1R7_SEC12                (1 << 12)
#define FLASH_SECBB1R7_SEC13                (1 << 13)
#define FLASH_SECBB1R7_SEC14                (1 << 14)
#define FLASH_SECBB1R7_SEC15                (1 << 15)
#define FLASH_SECBB1R7_SEC16                (1 << 16)
#define FLASH_SECBB1R7_SEC17                (1 << 17)
#define FLASH_SECBB1R7_SEC18                (1 << 18)
#define FLASH_SECBB1R7_SEC19                (1 << 19)
#define FLASH_SECBB1R7_SEC20                (1 << 20)
#define FLASH_SECBB1R7_SEC21                (1 << 21)
#define FLASH_SECBB1R7_SEC22                (1 << 22)
#define FLASH_SECBB1R7_SEC23                (1 << 23)
#define FLASH_SECBB1R7_SEC24                (1 << 24)
#define FLASH_SECBB1R7_SEC25                (1 << 25)
#define FLASH_SECBB1R7_SEC26                (1 << 26)
#define FLASH_SECBB1R7_SEC27                (1 << 27)
#define FLASH_SECBB1R7_SEC28                (1 << 28)
#define FLASH_SECBB1R7_SEC29                (1 << 29)
#define FLASH_SECBB1R7_SEC30                (1 << 30)
#define FLASH_SECBB1R7_SEC31                (1 << 31)

/* FLASH secure block-based bank 1 register 8 */

#define FLASH_SECBB1R8_SEC0                 (1 << 0)
#define FLASH_SECBB1R8_SEC1                 (1 << 1)
#define FLASH_SECBB1R8_SEC2                 (1 << 2)
#define FLASH_SECBB1R8_SEC3                 (1 << 3)
#define FLASH_SECBB1R8_SEC4                 (1 << 4)
#define FLASH_SECBB1R8_SEC5                 (1 << 5)
#define FLASH_SECBB1R8_SEC6                 (1 << 6)
#define FLASH_SECBB1R8_SEC7                 (1 << 7)
#define FLASH_SECBB1R8_SEC8                 (1 << 8)
#define FLASH_SECBB1R8_SEC9                 (1 << 9)
#define FLASH_SECBB1R8_SEC10                (1 << 10)
#define FLASH_SECBB1R8_SEC11                (1 << 11)
#define FLASH_SECBB1R8_SEC12                (1 << 12)
#define FLASH_SECBB1R8_SEC13                (1 << 13)
#define FLASH_SECBB1R8_SEC14                (1 << 14)
#define FLASH_SECBB1R8_SEC15                (1 << 15)
#define FLASH_SECBB1R8_SEC16                (1 << 16)
#define FLASH_SECBB1R8_SEC17                (1 << 17)
#define FLASH_SECBB1R8_SEC18                (1 << 18)
#define FLASH_SECBB1R8_SEC19                (1 << 19)
#define FLASH_SECBB1R8_SEC20                (1 << 20)
#define FLASH_SECBB1R8_SEC21                (1 << 21)
#define FLASH_SECBB1R8_SEC22                (1 << 22)
#define FLASH_SECBB1R8_SEC23                (1 << 23)
#define FLASH_SECBB1R8_SEC24                (1 << 24)
#define FLASH_SECBB1R8_SEC25                (1 << 25)
#define FLASH_SECBB1R8_SEC26                (1 << 26)
#define FLASH_SECBB1R8_SEC27                (1 << 27)
#define FLASH_SECBB1R8_SEC28                (1 << 28)
#define FLASH_SECBB1R8_SEC29                (1 << 29)
#define FLASH_SECBB1R8_SEC30                (1 << 30)
#define FLASH_SECBB1R8_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 1 */

#define FLASH_SECBB2R1_SEC0                 (1 << 0)
#define FLASH_SECBB2R1_SEC1                 (1 << 1)
#define FLASH_SECBB2R1_SEC2                 (1 << 2)
#define FLASH_SECBB2R1_SEC3                 (1 << 3)
#define FLASH_SECBB2R1_SEC4                 (1 << 4)
#define FLASH_SECBB2R1_SEC5                 (1 << 5)
#define FLASH_SECBB2R1_SEC6                 (1 << 6)
#define FLASH_SECBB2R1_SEC7                 (1 << 7)
#define FLASH_SECBB2R1_SEC8                 (1 << 8)
#define FLASH_SECBB2R1_SEC9                 (1 << 9)
#define FLASH_SECBB2R1_SEC10                (1 << 10)
#define FLASH_SECBB2R1_SEC11                (1 << 11)
#define FLASH_SECBB2R1_SEC12                (1 << 12)
#define FLASH_SECBB2R1_SEC13                (1 << 13)
#define FLASH_SECBB2R1_SEC14                (1 << 14)
#define FLASH_SECBB2R1_SEC15                (1 << 15)
#define FLASH_SECBB2R1_SEC16                (1 << 16)
#define FLASH_SECBB2R1_SEC17                (1 << 17)
#define FLASH_SECBB2R1_SEC18                (1 << 18)
#define FLASH_SECBB2R1_SEC19                (1 << 19)
#define FLASH_SECBB2R1_SEC20                (1 << 20)
#define FLASH_SECBB2R1_SEC21                (1 << 21)
#define FLASH_SECBB2R1_SEC22                (1 << 22)
#define FLASH_SECBB2R1_SEC23                (1 << 23)
#define FLASH_SECBB2R1_SEC24                (1 << 24)
#define FLASH_SECBB2R1_SEC25                (1 << 25)
#define FLASH_SECBB2R1_SEC26                (1 << 26)
#define FLASH_SECBB2R1_SEC27                (1 << 27)
#define FLASH_SECBB2R1_SEC28                (1 << 28)
#define FLASH_SECBB2R1_SEC29                (1 << 29)
#define FLASH_SECBB2R1_SEC30                (1 << 30)
#define FLASH_SECBB2R1_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 2 */

#define FLASH_SECBB2R2_SEC0                 (1 << 0)
#define FLASH_SECBB2R2_SEC1                 (1 << 1)
#define FLASH_SECBB2R2_SEC2                 (1 << 2)
#define FLASH_SECBB2R2_SEC3                 (1 << 3)
#define FLASH_SECBB2R2_SEC4                 (1 << 4)
#define FLASH_SECBB2R2_SEC5                 (1 << 5)
#define FLASH_SECBB2R2_SEC6                 (1 << 6)
#define FLASH_SECBB2R2_SEC7                 (1 << 7)
#define FLASH_SECBB2R2_SEC8                 (1 << 8)
#define FLASH_SECBB2R2_SEC9                 (1 << 9)
#define FLASH_SECBB2R2_SEC10                (1 << 10)
#define FLASH_SECBB2R2_SEC11                (1 << 11)
#define FLASH_SECBB2R2_SEC12                (1 << 12)
#define FLASH_SECBB2R2_SEC13                (1 << 13)
#define FLASH_SECBB2R2_SEC14                (1 << 14)
#define FLASH_SECBB2R2_SEC15                (1 << 15)
#define FLASH_SECBB2R2_SEC16                (1 << 16)
#define FLASH_SECBB2R2_SEC17                (1 << 17)
#define FLASH_SECBB2R2_SEC18                (1 << 18)
#define FLASH_SECBB2R2_SEC19                (1 << 19)
#define FLASH_SECBB2R2_SEC20                (1 << 20)
#define FLASH_SECBB2R2_SEC21                (1 << 21)
#define FLASH_SECBB2R2_SEC22                (1 << 22)
#define FLASH_SECBB2R2_SEC23                (1 << 23)
#define FLASH_SECBB2R2_SEC24                (1 << 24)
#define FLASH_SECBB2R2_SEC25                (1 << 25)
#define FLASH_SECBB2R2_SEC26                (1 << 26)
#define FLASH_SECBB2R2_SEC27                (1 << 27)
#define FLASH_SECBB2R2_SEC28                (1 << 28)
#define FLASH_SECBB2R2_SEC29                (1 << 29)
#define FLASH_SECBB2R2_SEC30                (1 << 30)
#define FLASH_SECBB2R2_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 3 */

#define FLASH_SECBB2R3_SEC0                 (1 << 0)
#define FLASH_SECBB2R3_SEC1                 (1 << 1)
#define FLASH_SECBB2R3_SEC2                 (1 << 2)
#define FLASH_SECBB2R3_SEC3                 (1 << 3)
#define FLASH_SECBB2R3_SEC4                 (1 << 4)
#define FLASH_SECBB2R3_SEC5                 (1 << 5)
#define FLASH_SECBB2R3_SEC6                 (1 << 6)
#define FLASH_SECBB2R3_SEC7                 (1 << 7)
#define FLASH_SECBB2R3_SEC8                 (1 << 8)
#define FLASH_SECBB2R3_SEC9                 (1 << 9)
#define FLASH_SECBB2R3_SEC10                (1 << 10)
#define FLASH_SECBB2R3_SEC11                (1 << 11)
#define FLASH_SECBB2R3_SEC12                (1 << 12)
#define FLASH_SECBB2R3_SEC13                (1 << 13)
#define FLASH_SECBB2R3_SEC14                (1 << 14)
#define FLASH_SECBB2R3_SEC15                (1 << 15)
#define FLASH_SECBB2R3_SEC16                (1 << 16)
#define FLASH_SECBB2R3_SEC17                (1 << 17)
#define FLASH_SECBB2R3_SEC18                (1 << 18)
#define FLASH_SECBB2R3_SEC19                (1 << 19)
#define FLASH_SECBB2R3_SEC20                (1 << 20)
#define FLASH_SECBB2R3_SEC21                (1 << 21)
#define FLASH_SECBB2R3_SEC22                (1 << 22)
#define FLASH_SECBB2R3_SEC23                (1 << 23)
#define FLASH_SECBB2R3_SEC24                (1 << 24)
#define FLASH_SECBB2R3_SEC25                (1 << 25)
#define FLASH_SECBB2R3_SEC26                (1 << 26)
#define FLASH_SECBB2R3_SEC27                (1 << 27)
#define FLASH_SECBB2R3_SEC28                (1 << 28)
#define FLASH_SECBB2R3_SEC29                (1 << 29)
#define FLASH_SECBB2R3_SEC30                (1 << 30)
#define FLASH_SECBB2R3_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 4 */

