apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
#define FLASH_SECBB2R4_SEC0                 (1 << 0)
#define FLASH_SECBB2R4_SEC1                 (1 << 1)
#define FLASH_SECBB2R4_SEC2                 (1 << 2)
#define FLASH_SECBB2R4_SEC3                 (1 << 3)
#define FLASH_SECBB2R4_SEC4                 (1 << 4)
#define FLASH_SECBB2R4_SEC5                 (1 << 5)
#define FLASH_SECBB2R4_SEC6                 (1 << 6)
#define FLASH_SECBB2R4_SEC7                 (1 << 7)
#define FLASH_SECBB2R4_SEC8                 (1 << 8)
#define FLASH_SECBB2R4_SEC9                 (1 << 9)
#define FLASH_SECBB2R4_SEC10                (1 << 10)
#define FLASH_SECBB2R4_SEC11                (1 << 11)
#define FLASH_SECBB2R4_SEC12                (1 << 12)
#define FLASH_SECBB2R4_SEC13                (1 << 13)
#define FLASH_SECBB2R4_SEC14                (1 << 14)
#define FLASH_SECBB2R4_SEC15                (1 << 15)
#define FLASH_SECBB2R4_SEC16                (1 << 16)
#define FLASH_SECBB2R4_SEC17                (1 << 17)
#define FLASH_SECBB2R4_SEC18                (1 << 18)
#define FLASH_SECBB2R4_SEC19                (1 << 19)
#define FLASH_SECBB2R4_SEC20                (1 << 20)
#define FLASH_SECBB2R4_SEC21                (1 << 21)
#define FLASH_SECBB2R4_SEC22                (1 << 22)
#define FLASH_SECBB2R4_SEC23                (1 << 23)
#define FLASH_SECBB2R4_SEC24                (1 << 24)
#define FLASH_SECBB2R4_SEC25                (1 << 25)
#define FLASH_SECBB2R4_SEC26                (1 << 26)
#define FLASH_SECBB2R4_SEC27                (1 << 27)
#define FLASH_SECBB2R4_SEC28                (1 << 28)
#define FLASH_SECBB2R4_SEC29                (1 << 29)
#define FLASH_SECBB2R4_SEC30                (1 << 30)
#define FLASH_SECBB2R4_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 5 */

#define FLASH_SECBB2R5_SEC0                 (1 << 0)
#define FLASH_SECBB2R5_SEC1                 (1 << 1)
#define FLASH_SECBB2R5_SEC2                 (1 << 2)
#define FLASH_SECBB2R5_SEC3                 (1 << 3)
#define FLASH_SECBB2R5_SEC4                 (1 << 4)
#define FLASH_SECBB2R5_SEC5                 (1 << 5)
#define FLASH_SECBB2R5_SEC6                 (1 << 6)
#define FLASH_SECBB2R5_SEC7                 (1 << 7)
#define FLASH_SECBB2R5_SEC8                 (1 << 8)
#define FLASH_SECBB2R5_SEC9                 (1 << 9)
#define FLASH_SECBB2R5_SEC10                (1 << 10)
#define FLASH_SECBB2R5_SEC11                (1 << 11)
#define FLASH_SECBB2R5_SEC12                (1 << 12)
#define FLASH_SECBB2R5_SEC13                (1 << 13)
#define FLASH_SECBB2R5_SEC14                (1 << 14)
#define FLASH_SECBB2R5_SEC15                (1 << 15)
#define FLASH_SECBB2R5_SEC16                (1 << 16)
#define FLASH_SECBB2R5_SEC17                (1 << 17)
#define FLASH_SECBB2R5_SEC18                (1 << 18)
#define FLASH_SECBB2R5_SEC19                (1 << 19)
#define FLASH_SECBB2R5_SEC20                (1 << 20)
#define FLASH_SECBB2R5_SEC21                (1 << 21)
#define FLASH_SECBB2R5_SEC22                (1 << 22)
#define FLASH_SECBB2R5_SEC23                (1 << 23)
#define FLASH_SECBB2R5_SEC24                (1 << 24)
#define FLASH_SECBB2R5_SEC25                (1 << 25)
#define FLASH_SECBB2R5_SEC26                (1 << 26)
#define FLASH_SECBB2R5_SEC27                (1 << 27)
#define FLASH_SECBB2R5_SEC28                (1 << 28)
#define FLASH_SECBB2R5_SEC29                (1 << 29)
#define FLASH_SECBB2R5_SEC30                (1 << 30)
#define FLASH_SECBB2R5_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 6 */

#define FLASH_SECBB2R6_SEC0                 (1 << 0)
#define FLASH_SECBB2R6_SEC1                 (1 << 1)
#define FLASH_SECBB2R6_SEC2                 (1 << 2)
#define FLASH_SECBB2R6_SEC3                 (1 << 3)
#define FLASH_SECBB2R6_SEC4                 (1 << 4)
#define FLASH_SECBB2R6_SEC5                 (1 << 5)
#define FLASH_SECBB2R6_SEC6                 (1 << 6)
#define FLASH_SECBB2R6_SEC7                 (1 << 7)
#define FLASH_SECBB2R6_SEC8                 (1 << 8)
#define FLASH_SECBB2R6_SEC9                 (1 << 9)
#define FLASH_SECBB2R6_SEC10                (1 << 10)
#define FLASH_SECBB2R6_SEC11                (1 << 11)
#define FLASH_SECBB2R6_SEC12                (1 << 12)
#define FLASH_SECBB2R6_SEC13                (1 << 13)
#define FLASH_SECBB2R6_SEC14                (1 << 14)
#define FLASH_SECBB2R6_SEC15                (1 << 15)
#define FLASH_SECBB2R6_SEC16                (1 << 16)
#define FLASH_SECBB2R6_SEC17                (1 << 17)
#define FLASH_SECBB2R6_SEC18                (1 << 18)
#define FLASH_SECBB2R6_SEC19                (1 << 19)
#define FLASH_SECBB2R6_SEC20                (1 << 20)
#define FLASH_SECBB2R6_SEC21                (1 << 21)
#define FLASH_SECBB2R6_SEC22                (1 << 22)
#define FLASH_SECBB2R6_SEC23                (1 << 23)
#define FLASH_SECBB2R6_SEC24                (1 << 24)
#define FLASH_SECBB2R6_SEC25                (1 << 25)
#define FLASH_SECBB2R6_SEC26                (1 << 26)
#define FLASH_SECBB2R6_SEC27                (1 << 27)
#define FLASH_SECBB2R6_SEC28                (1 << 28)
#define FLASH_SECBB2R6_SEC29                (1 << 29)
#define FLASH_SECBB2R6_SEC30                (1 << 30)
#define FLASH_SECBB2R6_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 7 */

#define FLASH_SECBB2R7_SEC0                 (1 << 0)
#define FLASH_SECBB2R7_SEC1                 (1 << 1)
#define FLASH_SECBB2R7_SEC2                 (1 << 2)
#define FLASH_SECBB2R7_SEC3                 (1 << 3)
#define FLASH_SECBB2R7_SEC4                 (1 << 4)
#define FLASH_SECBB2R7_SEC5                 (1 << 5)
#define FLASH_SECBB2R7_SEC6                 (1 << 6)
#define FLASH_SECBB2R7_SEC7                 (1 << 7)
#define FLASH_SECBB2R7_SEC8                 (1 << 8)
#define FLASH_SECBB2R7_SEC9                 (1 << 9)
#define FLASH_SECBB2R7_SEC10                (1 << 10)
#define FLASH_SECBB2R7_SEC11                (1 << 11)
#define FLASH_SECBB2R7_SEC12                (1 << 12)
#define FLASH_SECBB2R7_SEC13                (1 << 13)
#define FLASH_SECBB2R7_SEC14                (1 << 14)
#define FLASH_SECBB2R7_SEC15                (1 << 15)
#define FLASH_SECBB2R7_SEC16                (1 << 16)
#define FLASH_SECBB2R7_SEC17                (1 << 17)
#define FLASH_SECBB2R7_SEC18                (1 << 18)
#define FLASH_SECBB2R7_SEC19                (1 << 19)
#define FLASH_SECBB2R7_SEC20                (1 << 20)
#define FLASH_SECBB2R7_SEC21                (1 << 21)
#define FLASH_SECBB2R7_SEC22                (1 << 22)
#define FLASH_SECBB2R7_SEC23                (1 << 23)
#define FLASH_SECBB2R7_SEC24                (1 << 24)
#define FLASH_SECBB2R7_SEC25                (1 << 25)
#define FLASH_SECBB2R7_SEC26                (1 << 26)
#define FLASH_SECBB2R7_SEC27                (1 << 27)
#define FLASH_SECBB2R7_SEC28                (1 << 28)
#define FLASH_SECBB2R7_SEC29                (1 << 29)
#define FLASH_SECBB2R7_SEC30                (1 << 30)
#define FLASH_SECBB2R7_SEC31                (1 << 31)

/* FLASH secure block-based bank 2 register 8 */

