apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
#define FLASH_SECBB2R8_SEC0                 (1 << 0)
#define FLASH_SECBB2R8_SEC1                 (1 << 1)
#define FLASH_SECBB2R8_SEC2                 (1 << 2)
#define FLASH_SECBB2R8_SEC3                 (1 << 3)
#define FLASH_SECBB2R8_SEC4                 (1 << 4)
#define FLASH_SECBB2R8_SEC5                 (1 << 5)
#define FLASH_SECBB2R8_SEC6                 (1 << 6)
#define FLASH_SECBB2R8_SEC7                 (1 << 7)
#define FLASH_SECBB2R8_SEC8                 (1 << 8)
#define FLASH_SECBB2R8_SEC9                 (1 << 9)
#define FLASH_SECBB2R8_SEC10                (1 << 10)
#define FLASH_SECBB2R8_SEC11                (1 << 11)
#define FLASH_SECBB2R8_SEC12                (1 << 12)
#define FLASH_SECBB2R8_SEC13                (1 << 13)
#define FLASH_SECBB2R8_SEC14                (1 << 14)
#define FLASH_SECBB2R8_SEC15                (1 << 15)
#define FLASH_SECBB2R8_SEC16                (1 << 16)
#define FLASH_SECBB2R8_SEC17                (1 << 17)
#define FLASH_SECBB2R8_SEC18                (1 << 18)
#define FLASH_SECBB2R8_SEC19                (1 << 19)
#define FLASH_SECBB2R8_SEC20                (1 << 20)
#define FLASH_SECBB2R8_SEC21                (1 << 21)
#define FLASH_SECBB2R8_SEC22                (1 << 22)
#define FLASH_SECBB2R8_SEC23                (1 << 23)
#define FLASH_SECBB2R8_SEC24                (1 << 24)
#define FLASH_SECBB2R8_SEC25                (1 << 25)
#define FLASH_SECBB2R8_SEC26                (1 << 26)
#define FLASH_SECBB2R8_SEC27                (1 << 27)
#define FLASH_SECBB2R8_SEC28                (1 << 28)
#define FLASH_SECBB2R8_SEC29                (1 << 29)
#define FLASH_SECBB2R8_SEC30                (1 << 30)
#define FLASH_SECBB2R8_SEC31                (1 << 31)

/* FLASH secure HDP control register */

#define FLASH_SECHDPCR_HDP1_ACCDIS_SHIFT    (0)
#define FLASH_SECHDPCR_HDP1_ACCDIS_MASK     (0xff << FLASH_SECHDPCR_HDP1_ACCDIS_SHIFT)
#define FLASH_SECHDPCR_HDP1_ACCDIS(n)       ((n) << FLASH_SECHDPCR_HDP1_ACCDIS_SHIFT)
#define FLASH_SECHDPCR_HDP2_ACCDIS_SHIFT    (8)
#define FLASH_SECHDPCR_HDP2_ACCDIS_MASK     (0xff << FLASH_SECHDPCR_HDP2_ACCDIS_SHIFT)
#define FLASH_SECHDPCR_HDP2_ACCDIS(n)       ((n) << FLASH_SECHDPCR_HDP2_ACCDIS_SHIFT)
#define FLASH_SECHDPCR_HDP1EXT_ACCDIS_SHIFT (16)
#define FLASH_SECHDPCR_HDP1EXT_ACCDIS_MASK  (0xff << FLASH_SECHDPCR_HDP1EXT_ACCDIS_SHIFT)
#define FLASH_SECHDPCR_HDP1EXT_ACCDIS(n)    ((n) << FLASH_SECHDPCR_HDP1EXT_ACCDIS_SHIFT)
#define FLASH_SECHDPCR_HDP2EXT_ACCDIS_SHIFT (24)
#define FLASH_SECHDPCR_HDP2EXT_ACCDIS_MASK  (0xff << FLASH_SECHDPCR_HDP2EXT_ACCDIS_SHIFT)
#define FLASH_SECHDPCR_HDP2EXT_ACCDIS(n)    ((n) << FLASH_SECHDPCR_HDP2EXT_ACCDIS_SHIFT)

/* FLASH privilege configuration register */

#define FLASH_PRIVCFGR_SPRIV                (1 << 0)
#define FLASH_PRIVCFGR_PRIV                 (1 << 1)

/* FLASH HDP extension register */

#define FLASH_SECHDPEXTR_HDP1_EXT_SHIFT     (0)
#define FLASH_SECHDPEXTR_HDP1_EXT_MASK      (0x1ff << FLASH_SECHDPEXTR_HDP1_EXT_SHIFT)
#define FLASH_SECHDPEXTR_HDP1_EXT(n)        ((n) << FLASH_SECHDPEXTR_HDP1_EXT_SHIFT)
#define FLASH_SECHDPEXTR_HDP2_EXT_SHIFT     (16)
#define FLASH_SECHDPEXTR_HDP2_EXT_MASK      (0x1ff << FLASH_SECHDPEXTR_HDP2_EXT_SHIFT)
#define FLASH_SECHDPEXTR_HDP2_EXT(n)        ((n) << FLASH_SECHDPEXTR_HDP2_EXT_SHIFT)

/* FLASH privilege block-based bank 1 register 1 */

#define FLASH_PRIVBB1R1_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R1_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R1_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R1_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R1_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R1_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R1_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R1_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R1_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R1_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R1_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R1_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R1_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R1_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R1_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R1_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R1_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R1_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R1_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R1_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R1_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R1_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R1_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R1_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R1_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R1_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R1_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R1_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R1_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R1_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R1_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R1_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 1 register 2 */

#define FLASH_PRIVBB1R2_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R2_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R2_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R2_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R2_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R2_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R2_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R2_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R2_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R2_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R2_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R2_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R2_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R2_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R2_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R2_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R2_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R2_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R2_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R2_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R2_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R2_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R2_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R2_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R2_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R2_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R2_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R2_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R2_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R2_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R2_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R2_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 1 register 3 */

#define FLASH_PRIVBB1R3_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R3_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R3_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R3_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R3_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R3_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R3_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R3_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R3_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R3_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R3_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R3_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R3_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R3_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R3_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R3_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R3_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R3_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R3_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R3_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R3_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R3_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R3_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R3_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R3_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R3_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R3_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R3_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R3_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R3_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R3_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R3_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 1 register 4 */

#define FLASH_PRIVBB1R4_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R4_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R4_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R4_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R4_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R4_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R4_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R4_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R4_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R4_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R4_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R4_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R4_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R4_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R4_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R4_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R4_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R4_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R4_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R4_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R4_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R4_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R4_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R4_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R4_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R4_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R4_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R4_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R4_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R4_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R4_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R4_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 1 register 5 */

#define FLASH_PRIVBB1R5_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R5_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R5_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R5_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R5_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R5_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R5_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R5_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R5_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R5_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R5_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R5_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R5_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R5_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R5_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R5_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R5_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R5_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R5_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R5_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R5_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R5_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R5_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R5_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R5_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R5_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R5_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R5_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R5_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R5_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R5_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R5_PRIV31              (1 << 31)

