apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
/* FLASH privilege block-based bank 1 register 6 */

#define FLASH_PRIVBB1R6_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R6_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R6_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R6_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R6_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R6_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R6_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R6_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R6_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R6_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R6_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R6_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R6_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R6_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R6_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R6_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R6_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R6_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R6_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R6_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R6_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R6_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R6_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R6_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R6_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R6_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R6_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R6_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R6_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R6_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R6_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R6_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 1 register 7 */

#define FLASH_PRIVBB1R7_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R7_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R7_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R7_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R7_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R7_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R7_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R7_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R7_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R7_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R7_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R7_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R7_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R7_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R7_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R7_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R7_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R7_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R7_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R7_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R7_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R7_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R7_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R7_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R7_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R7_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R7_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R7_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R7_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R7_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R7_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R7_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 1 register 8 */

#define FLASH_PRIVBB1R8_PRIV0               (1 << 0)
#define FLASH_PRIVBB1R8_PRIV1               (1 << 1)
#define FLASH_PRIVBB1R8_PRIV2               (1 << 2)
#define FLASH_PRIVBB1R8_PRIV3               (1 << 3)
#define FLASH_PRIVBB1R8_PRIV4               (1 << 4)
#define FLASH_PRIVBB1R8_PRIV5               (1 << 5)
#define FLASH_PRIVBB1R8_PRIV6               (1 << 6)
#define FLASH_PRIVBB1R8_PRIV7               (1 << 7)
#define FLASH_PRIVBB1R8_PRIV8               (1 << 8)
#define FLASH_PRIVBB1R8_PRIV9               (1 << 9)
#define FLASH_PRIVBB1R8_PRIV10              (1 << 10)
#define FLASH_PRIVBB1R8_PRIV11              (1 << 11)
#define FLASH_PRIVBB1R8_PRIV12              (1 << 12)
#define FLASH_PRIVBB1R8_PRIV13              (1 << 13)
#define FLASH_PRIVBB1R8_PRIV14              (1 << 14)
#define FLASH_PRIVBB1R8_PRIV15              (1 << 15)
#define FLASH_PRIVBB1R8_PRIV16              (1 << 16)
#define FLASH_PRIVBB1R8_PRIV17              (1 << 17)
#define FLASH_PRIVBB1R8_PRIV18              (1 << 18)
#define FLASH_PRIVBB1R8_PRIV19              (1 << 19)
#define FLASH_PRIVBB1R8_PRIV20              (1 << 20)
#define FLASH_PRIVBB1R8_PRIV21              (1 << 21)
#define FLASH_PRIVBB1R8_PRIV22              (1 << 22)
#define FLASH_PRIVBB1R8_PRIV23              (1 << 23)
#define FLASH_PRIVBB1R8_PRIV24              (1 << 24)
#define FLASH_PRIVBB1R8_PRIV25              (1 << 25)
#define FLASH_PRIVBB1R8_PRIV26              (1 << 26)
#define FLASH_PRIVBB1R8_PRIV27              (1 << 27)
#define FLASH_PRIVBB1R8_PRIV28              (1 << 28)
#define FLASH_PRIVBB1R8_PRIV29              (1 << 29)
#define FLASH_PRIVBB1R8_PRIV30              (1 << 30)
#define FLASH_PRIVBB1R8_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 2 register 1 */

#define FLASH_PRIVBB2R1_PRIV0               (1 << 0)
#define FLASH_PRIVBB2R1_PRIV1               (1 << 1)
#define FLASH_PRIVBB2R1_PRIV2               (1 << 2)
#define FLASH_PRIVBB2R1_PRIV3               (1 << 3)
#define FLASH_PRIVBB2R1_PRIV4               (1 << 4)
#define FLASH_PRIVBB2R1_PRIV5               (1 << 5)
#define FLASH_PRIVBB2R1_PRIV6               (1 << 6)
#define FLASH_PRIVBB2R1_PRIV7               (1 << 7)
#define FLASH_PRIVBB2R1_PRIV8               (1 << 8)
#define FLASH_PRIVBB2R1_PRIV9               (1 << 9)
#define FLASH_PRIVBB2R1_PRIV10              (1 << 10)
#define FLASH_PRIVBB2R1_PRIV11              (1 << 11)
#define FLASH_PRIVBB2R1_PRIV12              (1 << 12)
#define FLASH_PRIVBB2R1_PRIV13              (1 << 13)
#define FLASH_PRIVBB2R1_PRIV14              (1 << 14)
#define FLASH_PRIVBB2R1_PRIV15              (1 << 15)
#define FLASH_PRIVBB2R1_PRIV16              (1 << 16)
#define FLASH_PRIVBB2R1_PRIV17              (1 << 17)
#define FLASH_PRIVBB2R1_PRIV18              (1 << 18)
#define FLASH_PRIVBB2R1_PRIV19              (1 << 19)
#define FLASH_PRIVBB2R1_PRIV20              (1 << 20)
#define FLASH_PRIVBB2R1_PRIV21              (1 << 21)
#define FLASH_PRIVBB2R1_PRIV22              (1 << 22)
#define FLASH_PRIVBB2R1_PRIV23              (1 << 23)
#define FLASH_PRIVBB2R1_PRIV24              (1 << 24)
#define FLASH_PRIVBB2R1_PRIV25              (1 << 25)
#define FLASH_PRIVBB2R1_PRIV26              (1 << 26)
#define FLASH_PRIVBB2R1_PRIV27              (1 << 27)
#define FLASH_PRIVBB2R1_PRIV28              (1 << 28)
#define FLASH_PRIVBB2R1_PRIV29              (1 << 29)
#define FLASH_PRIVBB2R1_PRIV30              (1 << 30)
#define FLASH_PRIVBB2R1_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 2 register 2 */

