apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
#define FLASH_PRIVBB2R2_PRIV0               (1 << 0)
#define FLASH_PRIVBB2R2_PRIV1               (1 << 1)
#define FLASH_PRIVBB2R2_PRIV2               (1 << 2)
#define FLASH_PRIVBB2R2_PRIV3               (1 << 3)
#define FLASH_PRIVBB2R2_PRIV4               (1 << 4)
#define FLASH_PRIVBB2R2_PRIV5               (1 << 5)
#define FLASH_PRIVBB2R2_PRIV6               (1 << 6)
#define FLASH_PRIVBB2R2_PRIV7               (1 << 7)
#define FLASH_PRIVBB2R2_PRIV8               (1 << 8)
#define FLASH_PRIVBB2R2_PRIV9               (1 << 9)
#define FLASH_PRIVBB2R2_PRIV10              (1 << 10)
#define FLASH_PRIVBB2R2_PRIV11              (1 << 11)
#define FLASH_PRIVBB2R2_PRIV12              (1 << 12)
#define FLASH_PRIVBB2R2_PRIV13              (1 << 13)
#define FLASH_PRIVBB2R2_PRIV14              (1 << 14)
#define FLASH_PRIVBB2R2_PRIV15              (1 << 15)
#define FLASH_PRIVBB2R2_PRIV16              (1 << 16)
#define FLASH_PRIVBB2R2_PRIV17              (1 << 17)
#define FLASH_PRIVBB2R2_PRIV18              (1 << 18)
#define FLASH_PRIVBB2R2_PRIV19              (1 << 19)
#define FLASH_PRIVBB2R2_PRIV20              (1 << 20)
#define FLASH_PRIVBB2R2_PRIV21              (1 << 21)
#define FLASH_PRIVBB2R2_PRIV22              (1 << 22)
#define FLASH_PRIVBB2R2_PRIV23              (1 << 23)
#define FLASH_PRIVBB2R2_PRIV24              (1 << 24)
#define FLASH_PRIVBB2R2_PRIV25              (1 << 25)
#define FLASH_PRIVBB2R2_PRIV26              (1 << 26)
#define FLASH_PRIVBB2R2_PRIV27              (1 << 27)
#define FLASH_PRIVBB2R2_PRIV28              (1 << 28)
#define FLASH_PRIVBB2R2_PRIV29              (1 << 29)
#define FLASH_PRIVBB2R2_PRIV30              (1 << 30)
#define FLASH_PRIVBB2R2_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 2 register 3 */

#define FLASH_PRIVBB2R3_PRIV0               (1 << 0)
#define FLASH_PRIVBB2R3_PRIV1               (1 << 1)
#define FLASH_PRIVBB2R3_PRIV2               (1 << 2)
#define FLASH_PRIVBB2R3_PRIV3               (1 << 3)
#define FLASH_PRIVBB2R3_PRIV4               (1 << 4)
#define FLASH_PRIVBB2R3_PRIV5               (1 << 5)
#define FLASH_PRIVBB2R3_PRIV6               (1 << 6)
#define FLASH_PRIVBB2R3_PRIV7               (1 << 7)
#define FLASH_PRIVBB2R3_PRIV8               (1 << 8)
#define FLASH_PRIVBB2R3_PRIV9               (1 << 9)
#define FLASH_PRIVBB2R3_PRIV10              (1 << 10)
#define FLASH_PRIVBB2R3_PRIV11              (1 << 11)
#define FLASH_PRIVBB2R3_PRIV12              (1 << 12)
#define FLASH_PRIVBB2R3_PRIV13              (1 << 13)
#define FLASH_PRIVBB2R3_PRIV14              (1 << 14)
#define FLASH_PRIVBB2R3_PRIV15              (1 << 15)
#define FLASH_PRIVBB2R3_PRIV16              (1 << 16)
#define FLASH_PRIVBB2R3_PRIV17              (1 << 17)
#define FLASH_PRIVBB2R3_PRIV18              (1 << 18)
#define FLASH_PRIVBB2R3_PRIV19              (1 << 19)
#define FLASH_PRIVBB2R3_PRIV20              (1 << 20)
#define FLASH_PRIVBB2R3_PRIV21              (1 << 21)
#define FLASH_PRIVBB2R3_PRIV22              (1 << 22)
#define FLASH_PRIVBB2R3_PRIV23              (1 << 23)
#define FLASH_PRIVBB2R3_PRIV24              (1 << 24)
#define FLASH_PRIVBB2R3_PRIV25              (1 << 25)
#define FLASH_PRIVBB2R3_PRIV26              (1 << 26)
#define FLASH_PRIVBB2R3_PRIV27              (1 << 27)
#define FLASH_PRIVBB2R3_PRIV28              (1 << 28)
#define FLASH_PRIVBB2R3_PRIV29              (1 << 29)
#define FLASH_PRIVBB2R3_PRIV30              (1 << 30)
#define FLASH_PRIVBB2R3_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 2 register 4 */

#define FLASH_PRIVBB2R4_PRIV0               (1 << 0)
#define FLASH_PRIVBB2R4_PRIV1               (1 << 1)
#define FLASH_PRIVBB2R4_PRIV2               (1 << 2)
#define FLASH_PRIVBB2R4_PRIV3               (1 << 3)
#define FLASH_PRIVBB2R4_PRIV4               (1 << 4)
#define FLASH_PRIVBB2R4_PRIV5               (1 << 5)
#define FLASH_PRIVBB2R4_PRIV6               (1 << 6)
#define FLASH_PRIVBB2R4_PRIV7               (1 << 7)
#define FLASH_PRIVBB2R4_PRIV8               (1 << 8)
#define FLASH_PRIVBB2R4_PRIV9               (1 << 9)
#define FLASH_PRIVBB2R4_PRIV10              (1 << 10)
#define FLASH_PRIVBB2R4_PRIV11              (1 << 11)
#define FLASH_PRIVBB2R4_PRIV12              (1 << 12)
#define FLASH_PRIVBB2R4_PRIV13              (1 << 13)
#define FLASH_PRIVBB2R4_PRIV14              (1 << 14)
#define FLASH_PRIVBB2R4_PRIV15              (1 << 15)
#define FLASH_PRIVBB2R4_PRIV16              (1 << 16)
#define FLASH_PRIVBB2R4_PRIV17              (1 << 17)
#define FLASH_PRIVBB2R4_PRIV18              (1 << 18)
#define FLASH_PRIVBB2R4_PRIV19              (1 << 19)
#define FLASH_PRIVBB2R4_PRIV20              (1 << 20)
#define FLASH_PRIVBB2R4_PRIV21              (1 << 21)
#define FLASH_PRIVBB2R4_PRIV22              (1 << 22)
#define FLASH_PRIVBB2R4_PRIV23              (1 << 23)
#define FLASH_PRIVBB2R4_PRIV24              (1 << 24)
#define FLASH_PRIVBB2R4_PRIV25              (1 << 25)
#define FLASH_PRIVBB2R4_PRIV26              (1 << 26)
#define FLASH_PRIVBB2R4_PRIV27              (1 << 27)
#define FLASH_PRIVBB2R4_PRIV28              (1 << 28)
#define FLASH_PRIVBB2R4_PRIV29              (1 << 29)
#define FLASH_PRIVBB2R4_PRIV30              (1 << 30)
#define FLASH_PRIVBB2R4_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 2 register 5 */

#define FLASH_PRIVBB2R5_PRIV0               (1 << 0)
#define FLASH_PRIVBB2R5_PRIV1               (1 << 1)
#define FLASH_PRIVBB2R5_PRIV2               (1 << 2)
#define FLASH_PRIVBB2R5_PRIV3               (1 << 3)
#define FLASH_PRIVBB2R5_PRIV4               (1 << 4)
#define FLASH_PRIVBB2R5_PRIV5               (1 << 5)
#define FLASH_PRIVBB2R5_PRIV6               (1 << 6)
#define FLASH_PRIVBB2R5_PRIV7               (1 << 7)
#define FLASH_PRIVBB2R5_PRIV8               (1 << 8)
#define FLASH_PRIVBB2R5_PRIV9               (1 << 9)
#define FLASH_PRIVBB2R5_PRIV10              (1 << 10)
#define FLASH_PRIVBB2R5_PRIV11              (1 << 11)
#define FLASH_PRIVBB2R5_PRIV12              (1 << 12)
#define FLASH_PRIVBB2R5_PRIV13              (1 << 13)
#define FLASH_PRIVBB2R5_PRIV14              (1 << 14)
#define FLASH_PRIVBB2R5_PRIV15              (1 << 15)
#define FLASH_PRIVBB2R5_PRIV16              (1 << 16)
#define FLASH_PRIVBB2R5_PRIV17              (1 << 17)
#define FLASH_PRIVBB2R5_PRIV18              (1 << 18)
#define FLASH_PRIVBB2R5_PRIV19              (1 << 19)
#define FLASH_PRIVBB2R5_PRIV20              (1 << 20)
#define FLASH_PRIVBB2R5_PRIV21              (1 << 21)
#define FLASH_PRIVBB2R5_PRIV22              (1 << 22)
#define FLASH_PRIVBB2R5_PRIV23              (1 << 23)
#define FLASH_PRIVBB2R5_PRIV24              (1 << 24)
#define FLASH_PRIVBB2R5_PRIV25              (1 << 25)
#define FLASH_PRIVBB2R5_PRIV26              (1 << 26)
#define FLASH_PRIVBB2R5_PRIV27              (1 << 27)
#define FLASH_PRIVBB2R5_PRIV28              (1 << 28)
#define FLASH_PRIVBB2R5_PRIV29              (1 << 29)
#define FLASH_PRIVBB2R5_PRIV30              (1 << 30)
#define FLASH_PRIVBB2R5_PRIV31              (1 << 31)

/* FLASH privilege block-based bank 2 register 6 */

