apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_flash.h
/* FLASH OEM1 key register 4 */

#define FLASH_OEM1KEYR4_OEM1KEY_SHIFT       (0)
#define FLASH_OEM1KEYR4_OEM1KEY_MASK        (0xffffffff << FLASH_OEM1KEYR4_OEM1KEY_SHIFT)
#define FLASH_OEM1KEYR4_OEM1KEY(n)          ((n) << FLASH_OEM1KEYR4_OEM1KEY_SHIFT)

/* FLASH OEM2 key register 1 */

#define FLASH_OEM2KEYR1_OEM2KEY_SHIFT       (0)
#define FLASH_OEM2KEYR1_OEM2KEY_MASK        (0xffffffff << FLASH_OEM2KEYR1_OEM2KEY_SHIFT)
#define FLASH_OEM2KEYR1_OEM2KEY(n)          ((n) << FLASH_OEM2KEYR1_OEM2KEY_SHIFT)

/* FLASH OEM2 key register 2 */

#define FLASH_OEM2KEYR2_OEM2KEY_SHIFT       (0)
#define FLASH_OEM2KEYR2_OEM2KEY_MASK        (0xffffffff << FLASH_OEM2KEYR2_OEM2KEY_SHIFT)
#define FLASH_OEM2KEYR2_OEM2KEY(n)          ((n) << FLASH_OEM2KEYR2_OEM2KEY_SHIFT)

/* FLASH OEM2 key register 3 */

#define FLASH_OEM2KEYR3_OEM2KEY_SHIFT       (0)
#define FLASH_OEM2KEYR3_OEM2KEY_MASK        (0xffffffff << FLASH_OEM2KEYR3_OEM2KEY_SHIFT)
#define FLASH_OEM2KEYR3_OEM2KEY(n)          ((n) << FLASH_OEM2KEYR3_OEM2KEY_SHIFT)

/* FLASH OEM2 key register 4 */

#define FLASH_OEM2KEYR4_OEM2KEY_SHIFT       (0)
#define FLASH_OEM2KEYR4_OEM2KEY_MASK        (0xffffffff << FLASH_OEM2KEYR4_OEM2KEY_SHIFT)
#define FLASH_OEM2KEYR4_OEM2KEY(n)          ((n) << FLASH_OEM2KEYR4_OEM2KEY_SHIFT)

/* FLASH OEM key status register */

#define FLASH_OEMKEYSR_OEM1KEYCRC_SHIFT     (0)
#define FLASH_OEMKEYSR_OEM1KEYCRC_MASK      (0xff << FLASH_OEMKEYSR_OEM1KEYCRC_SHIFT)
#define FLASH_OEMKEYSR_OEM1KEYCRC(n)        ((n) << FLASH_OEMKEYSR_OEM1KEYCRC_SHIFT)
#define FLASH_OEMKEYSR_OEM2KEYCRC_SHIFT     (16)
#define FLASH_OEMKEYSR_OEM2KEYCRC_MASK      (0xff << FLASH_OEMKEYSR_OEM2KEYCRC_SHIFT)
#define FLASH_OEMKEYSR_OEM2KEYCRC(n)        ((n) << FLASH_OEMKEYSR_OEM2KEYCRC_SHIFT)

#endif /* __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_FLASH_H */
